<template>
  <div class='mb-10'>
    <m-bread-crumbs :crumbs='breadCrumbs'/>

    <h1 class='font-bold text-3xl mb-10'>
      Популярные вопросы
    </h1>

    <div class='prose lg:prose-xl prose-stone dark:prose-invert mb-10 max-w-none'>
      <h2>
        Где я нахожусь?
      </h2>
      <p>
        Это отличный сервисный сайт, где вы можете ознакомиться с последними предложениями от популярных магазинов,
        услуг, игр и мобильных приложений, а также использовать скидочные промокоды, чтобы сэкономить деньги.
      </p>
      <h2>
        Что такое промокоды?
      </h2>
      <p>
        Промокоды обычно представляют собой слова или случайные комбинации букв и цифр, которые предлагают специальные
        скидки, бесплатную доставку или приятные подарки.
      </p>
      <h2>
        Где взять промокоды?
      </h2>
      Чтобы получить промокод, перейдите в раздел <nuxt-link class='text-primary' to='/alphabet'>"Все магазины"</nuxt-link>, чтобы найти нужный вам магазин, или воспользуйтесь
      поиском в верхней части страницы, чтобы найти магазин на нашем сайте. Нажмите на кнопку "Открыть купон", и
      промокод откроется на новой странице, откуда вы сможете скопировать его и использовать для оформления заказа на
      сайте интернет-магазина.
      <h2>
        Как использовать промокоды?
      </h2>
      <p>
        Промокоды можно применять на любом этапе процесса оформления заказа в интернет-магазине. Там вы увидите поле
        "промокод" с таким же или похожим названием." Секретные слова", "Волшебные слова", "Промокод" и т.д. Введите в
        это поле промокод, который вы получили на нашей странице, и нажмите "Применить", если он у вас есть. Затем
        завершите процесс оформления заказа.
      </p>
      <p>
        Если поля "Промокод" нет, но есть поле "Комментарии к заказу", пожалуйста, укажите промокод там. Администратор
        интернет-магазина применит промокод к вашему заказу.
      </p>
      <h2>
        Это бесплатно?
      </h2>
      <p>
        Да, все наши промокоды являются бесплатными и общедоступными.
      </p>
      <h2>
        Как мне добавить свой промокод?
      </h2>
      <p>
        Если вы нашли промокод, который еще не введен, пожалуйста, отправьте его через <nuxt-link class='text-primary' to='/contacts'>форму обратной связи</nuxt-link>, и мы
        обязательно добавим его, если он действителен. В своем сообщении укажите, в каких магазинах действует промо-код,
        срок действия и любые другие условия (минимальная стоимость заказа, ограничения по категориям и т.д.). Если вы
        не знаете этой информации, пришлите нам промо-код и магазин, к которому он применяется, и мы сделаем все
        остальное.
      </p>
      <h2>
        Я добавил свой промокод, но он не отображается. Почему?
      </h2>
      <p>
        Возможно, ваши промокоды еще не проверены администратором. Как только они будут проверены, они будут размещены
        на сайте.
      </p>
      <h2>
        Я ввёл промокод, но он не работает. Что мне делать?
      </h2>
      <p>
        Пожалуйста, напишите по адресу support@za-halyavoi.ru, указав конкретный магазин и акцию, в которых промокод не
        сработал. Мы обязательно поможем вам.
      </p>
      <h2>
        Когда я открываю купон, но нет самого поля "Промокод". Что это значит?
      </h2>
      <p>
        Это означает, что вам не нужно вводить промокод, чтобы принять участие в акции и получить указанную скидку или
        подарок.
      </p>
      <h2>
        Как я могу узнать о новых акциях и промокодах?
      </h2>
      <ul>
        <li>Можете подписаться на наши социальные сети <a class='text-primary' href='https://vk.com/za_halyavoi' target='_blank'>vk</a>, <a class='text-primary' href='https://t.me/za_halyavoi' target='_blank'>telegram</a>;</li>
        <li>Подписаться на нашу e-mail рассылку.</li>
      </ul>
    </div>
  </div>
</template>

<script>

export default {
  components: {
    MBreadCrumbs: () => import('~/components/MBreadCrumbs.vue'),
  },
  head() {
    return {
      title: `Популярные вопросы по пользованию сайтом`,
      meta: [
        {
          hid: 'description',
          name: 'description',
          // @ts-ignore
          content: `Популярные вопросы по пользованию сайтом. Свежие промокоды, скидки и акции на ${this.$store.state.seo.month} ${this.$store.state.seo.year} год, а также эксклюзивные купоны. Бегом za халявой`
        },
        {
          hid: 'keywords',
          name: 'keywords',
          content: `сайты, популярные вопросы, промокоды, скидки, акции, магазины, акция, промокод, скидка, ${this.$store.state.seo.month}`
        },
        {
          property: "og:title",
          content: `Популярные вопросы по пользованию сайтом`
        },
        {
          property: "og:description",
          content: `Свежие промокоды, скидки и акции на ${this.$store.state.seo.month} ${this.$store.state.seo.year} год, а также эксклюзивные купоны. Бегом za халявой!`
        },
        {
          property: "og:url",
          content: `https://za-halyavoi.ru${this.$route.fullPath}`
        },
        {
          property: "og:image",
          content: "https://za-halyavoi.ru/za-halyavoi.png"
        },
        {
          property: "og:type",
          content: "website"
        },
        {
          property: "og:site_name",
          content: "за халявой"
        },
        {
          property: "og:image:url",
          content: "https://za-halyavoi.ru/logo.png"
        },
      ],
      link: [
        {
          rel: 'canonical',
          // @ts-ignore
          href: 'https://za-halyavoi.ru/faq'
        }
      ]
    }
  },
  data() {
    return {
      breadCrumbs: [
        {
          title: "Популярные вопросы"
        }
      ],
    }
  }
}
</script>
