<template>
  <div class="">
    <m-bread-crumbs
      :crumbs="breadCrumbs"
    />
    <h1 class="font-medium text-3xl mb-3">Пользовательское Соглашение</h1>

    <p class="mb-3">
      Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между владельцем
      https://za-halyavoi.ru (далее за халявой или Администрация) с одной стороны и пользователем сайта с другой. Сайт
      за халявой не является средством массовой информации.
    </p>

    <p>
      Используя сайт, Вы соглашаетесь с условиями данного соглашения.
    </p>

    <b class="mt-3 block">Если Вы не согласны с условиями данного соглашения, не используйте сайт за халявой!</b>

    <h2 class="mt-8 text-2xl">Предмет соглашения</h2>
    <b class="mt-3 block">Администрация предоставляет пользователю право на размещение на сайте следующей информации:</b>

    <h2 class="mt-8 text-2xl">Предмет соглашения</h2>
    <b class="mt-3 block">Администрация предоставляет пользователю право на размещение на сайте следующей информации:</b>
    <ul class="list-inside list-disc">
      <li>Текстовой информации</li>
      <li>Ссылок на материалы, размещенные на других сайтах</li>
    </ul>

    <h2 class="mt-8 text-2xl">Права и обязанности сторон</h2>
    <b class="mt-3 block">Пользователь имеет право:</b>
    <ul class="list-inside list-disc">
      <li>осуществлять поиск информации на сайте</li>
      <li>получать информацию на сайте</li>
      <li>распространять информацию на сайте</li>
      <li>комментировать контент, выложенный на сайте</li>
      <li>изменять рейтинг пользователей</li>
      <li>использовать информацию сайта в личных некоммерческих целях</li>
      <li>использовать информацию сайта в коммерческих целях с разрешения Администрации</li>
    </ul>

    <b class="mt-3 block">Администрация имеет право:</b>
    <ul class="list-inside list-disc">
      <li>по своему усмотрению и необходимости создавать, изменять, отменять правила</li>
      <li>ограничивать доступ к любой информации на сайте</li>
    </ul>

    <b class="mt-3 block">Пользователь обязуется:</b>
    <ul class="list-inside list-disc">
      <li>не нарушать работоспособность сайта</li>
      <li>не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и
        его Сервисами</li>
    </ul>

    <b class="mt-3 block">Администрация обязуется:</b>
    <ul class="list-inside list-disc">
      <li>поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от
        Администрации причинам.</li>
    </ul>

    <h2 class="mt-8 text-2xl">Ответственность сторон</h2>
    <ul class="list-inside list-disc">
      <li>администрация не несет никакой ответственности за достоверность информации, скопированной из других источников</li>
      <li>администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами</li>
      <li>в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и
        т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную
        работу информационного ресурса</li>
    </ul>

    <h2 class="mt-8 text-2xl">Условия действия Соглашения</h2>
    <p>
      Данное Соглашение вступает в силу при любом использовании данного сайта.
      Соглашение перестает действовать при появлении его новой версии.
      Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.
      При изменении соглашения, в некоторых случаях, администрация может оповестить пользователей удобным для нее способом.
    </p>
  </div>
</template>

<script lang="ts">

export default {
  components: {},

  data():any {
    return {
      breadCrumbs: [
        {
          title: 'Пользовательское соглашение'
        }
      ]
    }
  },
  head():any {
    return {
      title: 'Пользовательское Соглашение',
      meta: [
        {
          hid: 'description',
          name: 'description',
          // @ts-ignore
          content: `Пользовательское Соглашение. Свежие промокоды, скидки и акции на ${this.$store.state.seo.month} ${this.$store.state.seo.year} год, а также эксклюзивные купоны. го za халявой!`
        },
        {
          hid: 'keywords',
          name: 'keywords',
          content: 'сайты, политика, алфавит, промокоды, скидки, акции, магазины, акция, промокод, скидка'
        }
      ]
    }
  },
}
</script>
